# Task 1: Small case scenario of dataset analysis

## 1 - Create a dataset (The Tate Collection)
As a first example, we will create our own small dataset. In particular, the dataset will consist of 10 artists which are present in the Tate Collection along with the corresponding date of birth, date of death, place of birth and number of artworks.

|          Name         | Gender |   Year_Birth  |   Year_Death  | N_works |
|-----------------------|--------|---------------|---------------|---------|
|     Beuys, Joseph     |  Male  |      1921	 |      1986     |   588   |
|    Constable, John    |  Male  |      1776	 |      1837	 |   249   |
|   Daniell, William    |  Male  |      1769	 |      1837	 |   612   |
|   Forbes, Elizabeth   | Female |      1859	 |      1912	 |   120   |
|     Flaxman, John     |  Male  |      1755	 |      1826	 |   287   |
|    Phillips, Thomas   |  Male  |      1770	 |      1845	 |   274   |
| Paolozzi, Sir Eduardo |  Male  |      1924	 |      2005	 |   385   |
|     Schendel, Mira    | Female |      1919	 |      1988	 |    3    |
|    Turner, William    |  Male  |      1775	 |      1851	 |  1861   |
|      Warhol, Andy     |  Male  |      1928	 |      1987	 |   272   |

**_[TO DO]_**: Let's create a DataFrame named **TateDataset** within the information showed in table.

**Note:** You can create arrays for each column and then build the DataFrame.
Remember to import the required libraries!

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

### to be completed

## 2 - Data Acquisition (local file)

Data acquisition is a process of loading and reading data from various sources. We will learn how to export and read data from a local file in different format using  use **pandas** package. 

A file format is a standard way in which information is encoded to be stored in a file. Some examples of file format are: CSV, XLSX, and PKL. 

Let's practice with some examples.

### .CSV - Comma Separated Values

CSV is one of the most popular spreadsheet file format. In this kind of file, data is stored in cells. Each cell is organized in rows and columns. A column in the spreadsheet file can have different types. 

Let us look at how to create a CSV file. We can export a DataFrame by the pandas function **to_csv**. The file will be saved in the same location of this notebook unless specified otherwise. We can name the file **TateData.csv**.

**Note:** Once you have run the following function, check the output file .

In [2]:
TateDataset.to_csv('TateData.csv', index=False, header=True)

To pull in the csv file, we will use the pandas library **read_csv**. We will import the previous file in a new DataFrame.

**Note:**  Depending on where you save your notebooks, you may need to modify the location above.

In [3]:
Tate_1 = pd.read_csv('TateData.csv')
Tate_1

                    Name  Gender  Year_Birth  Year_Death  N_works
0          Beuys, Joseph    Male        1921        1986      588
1        Constable, John    Male        1776        1837      249
2       Daniell, William    Male        1769        1837      612
3      Forbes, Elizabeth  Female        1859        1912      120
4          Flaxman, John    Male        1755        1826      287
5       Phillips, Thomas    Male        1770        1845      274
6  Paolozzi, Sir Eduardo    Male        1924        2005      385
7         Schendel, Mira  Female        1919        1988        3
8        Turner, William    Male        1775        1851     1861
9           Warhol, Andy    Male        1928        1987      272

When we create the .CSV file, the only parameter we have used is **index**. 

**[TO DO]** What happens if we set the *index* parameter to True? And if you set also the parameter **header** to False?
Let's try by yourself.

In [2]:
### to be completed

Delete the csv file now that we are done using it.

### .XLSX file

XLSX is a Microsoft Excel Open XML file format and it is another example of spreadsheet file format. In XLSX data is organized under cells and columns in a sheet. 

As before, a DataFrame can be exported in XLSX file by pandas function.

In [3]:
TateDataset.to_excel('TateData.xlsx',index=False)

NameError: name 'TateDataset' is not defined

For loading the data you can use again the pandas library **read_excel**.

In [6]:
Tate_2 = pd.read_excel('TateData.xlsx') 
Tate_2

                    Name  Gender  Year_Birth  Year_Death  N_works
0          Beuys, Joseph    Male        1921        1986      588
1        Constable, John    Male        1776        1837      249
2       Daniell, William    Male        1769        1837      612
3      Forbes, Elizabeth  Female        1859        1912      120
4          Flaxman, John    Male        1755        1826      287
5       Phillips, Thomas    Male        1770        1845      274
6  Paolozzi, Sir Eduardo    Male        1924        2005      385
7         Schendel, Mira  Female        1919        1988        3
8        Turner, William    Male        1775        1851     1861
9           Warhol, Andy    Male        1928        1987      272

### Plain Text (.txt) file format

In Plain Text file format, everything is written in plain text. Usually, this text is a non-structured form and there is no meta-data associated with it. The .txt file format can easily be read by any program. But interpreting this is very difficult by a computer program.

To save a DataFrame in a text file, we will use the **NumPy** library.

In [7]:
np.savetxt('TateData.txt', TateDataset.values, fmt='%s', delimiter=';')

To open the file, use the built-in open() function.

The open() function returns a file object, which has a read() method for reading the content of the file:

In [8]:
Tate_3 = open('TateData.txt')
print(Tate_3.read())

Beuys, Joseph;Male;1921;1986;588
Constable, John;Male;1776;1837;249
Daniell, William;Male;1769;1837;612
Forbes, Elizabeth;Female;1859;1912;120
Flaxman, John;Male;1755;1826;287
Phillips, Thomas;Male;1770;1845;274
Paolozzi, Sir Eduardo;Male;1924;2005;385
Schendel, Mira;Female;1919;1988;3
Turner, William;Male;1775;1851;1861
Warhol, Andy;Male;1928;1987;272

### pickle — Python object serialization

This data format is Python-specific. This has the advantage that there are no restrictions imposed by external standards; however it means that non-Python programs may not be able to reconstruct pickled Python objects.

In [9]:
import pickle

TateDataset.to_pickle('TateData.pkl')

In [10]:
Tate_4 = pd.read_pickle('TateData.pkl')
Tate_4

                    Name  Gender  Year_Birth  Year_Death  N_works
0          Beuys, Joseph    Male        1921        1986      588
1        Constable, John    Male        1776        1837      249
2       Daniell, William    Male        1769        1837      612
3      Forbes, Elizabeth  Female        1859        1912      120
4          Flaxman, John    Male        1755        1826      287
5       Phillips, Thomas    Male        1770        1845      274
6  Paolozzi, Sir Eduardo    Male        1924        2005      385
7         Schendel, Mira  Female        1919        1988        3
8        Turner, William    Male        1775        1851     1861
9           Warhol, Andy    Male        1928        1987      272

## 3 - Look at the data

Now we will simply have a look at the data and make sure it is clean. 

### Data type
Let's check the data type of the imported variables and the original DataFrame.

In [11]:
# Check data type of the columns for Tate_1
Tate_1.dtypes

0                 int64
Beuys, Joseph    object
Male             object
1921              int64
1986              int64
588               int64
dtype: object

In [12]:
# Check data type of the columns for TateDataset
TateDataset.dtypes
### to be completed

Name          object
Gender        object
Year_Birth     int64
Year_Death     int64
N_works        int64
dtype: object

We can also display the values of a single column and check their data type as follow:

In [34]:
TateDataset['Gender']

0      Male
1      Male
2      Male
3    Female
4      Male
5      Male
6      Male
7    Female
8      Male
9      Male
Name: Gender, dtype: object

### Last born artist

To find the artist whose date of birth is the latest in the dataset, we have two option:

- sorting (in ascending order) the table based on the column of year of birth and selecting the top row value
- using the function **max( )** or **idxmax()**

In [2]:
# Method 1:

Sorted = TateDataset.sort_values(by='Year_Birth', ascending=False)
Sorted.head(1)

           Name Gender  Year_Birth  Year_Death  N_works
9  Warhol, Andy   Male        1928        1987      272

**[TO DO]** Let's try the method 2.

In [4]:
# Method 2:

### to be completed

NameError: name 'TateDataset' is not defined

**[TO DO]** Who is the first born artist in the dataset?

In [5]:
## Look for the oldest artist using the two methods.


### to be completed

### Display Data

In conjunction with the table, we can also plot the data to show the most/less popular value.

**plot( )** is a convenient attribute of pandas that plot the data in the dataframe. 
For instance, we can find the artist most popular in the Tate Collection plotting the value in the column 'N_works'.

In [6]:
# Create graph with labeled axis
TateDataset['N_works'].plot()
plt.xlabel('Artist Index')
plt.ylabel('# works')

# Maximum value in the data set
MaxValue = TateDataset['N_works'].max()

# Name associated with the maximum value of works
MaxName = TateDataset['Name'][TateDataset['N_works'] == TateDataset['N_works'].max()].values

print("The most popular artist is " + MaxName + " with " + str(MaxValue) + " works at the Tate.")

NameError: name 'TateDataset' is not defined

Alternatively, we can use *matplotlib* to have the name of the artist on the x-axis.

**NOTE** plt.xticks(rotation=*degrees*) might be useful, check the differences.

In [7]:
plt.plot(TateDataset['Name'], TateDataset['N_works'])
plt.xticks(rotation=90)
plt.show()

NameError: name 'TateDataset' is not defined

Another way to show distributions of the data is by plotting a **bar** plot or an **histogram**. 

Histograms are the best choice for probability distributions. Therefore, we can use it to plot how the date of birth is distributed.

**[TO DO]** make an histogram plot ranging between years 1750 and 1950, with a timestep of 25 years between each histogram bin. 

**HINT** use the *range* and *bins* attributes of [plt.hist](https://matplotlib.org/3.1.1/api/_as_gen/matplotlib.pyplot.hist.html).

In [8]:
## Histogram of Artists' date of birth

### to be completed

**[TO DO]** Let's check the most common gender of artists. Since the gender is a class, it is better to use a bar plot.

**NOTE** the plt.bar() function has two main parameters: *x* and *height*, where x defines the classes and height defines the number of observations for each class. 

*x* and *height* must be the same size, therefore we need to use the .groupby(*grouping column*).size() function in Pandas.

How do you get x (i.e. gender names) and height (i.e. number of males/females) from the grouped Dataset?

In [10]:
## Bar plot of Artists' gender

### to be completed